const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});


// 2 + 5 เท่ากับ ?

test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// -3 + 5 เท่ากับ 2

test('-3 + 5 เท่ากับ 2', ()=> {
  expect(sum(-3,5)).toBe(2);
});
// 1 + 1 เท่ากับ 2

test('1 + 1 เท่ากับ 2', ()=> {
  expect(sum(1,1)).toBe(2);
});
// 6 + 5 เท่ากับ 11

test('6 + 5 เท่ากับ 11', ()=> {
  expect(sum(6,5)).toBe(11);
});
